### List of Changed Stacks

```bash
stacks/modules
exitcode=0
stdout<<EOF
stacks/modules
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.master-module.aws_instance.test_module_instance will be created
  + resource "aws_instance" "test_module_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Azamon_master_instance"
        }
      + tags_all                             = {
          + "Name" = "Azamon_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.master-module.aws_subnet.master_public_subnet will be created
  + resource "aws_subnet" "master_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Azamon_master_subnet"
        }
      + tags_all                                       = {
          + "Name" = "Azamon_master_subnet"
        }
      + vpc_id                                         = "vpc-08c07fc88ec42d090"
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = "sg-06a080248f9c718af"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.sg.aws_security_group.allow_internet_traffic_master will be created
  + resource "aws_security_group" "allow_internet_traffic_master" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_allow_internet_traffic"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Azamon_allow_internet_traffic"
        }
      + tags_all               = {
          + "Name" = "Azamon_allow_internet_traffic"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_instance.slave_instance will be created
  + resource "aws_instance" "slave_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-06a080248f9c718af",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Azamon_slave_instance"
        }
      + tags_all                             = {
          + "Name" = "Azamon_slave_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.slave-module.aws_security_group.allow_internet_traffic will be created
  + resource "aws_security_group" "allow_internet_traffic" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the slave of Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_slave"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Azamon_slave"
        }
      + tags_all               = {
          + "Name" = "Azamon_slave"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be created
  + resource "aws_subnet" "slave_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Azamon_slave_subnet"
        }
      + tags_all                                       = {
          + "Name" = "Azamon_slave_subnet"
        }
      + vpc_id                                         = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.allow_ingress_from_master will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_ingress_from_master" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = "sg-06a080248f9c718af"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.test-modules.aws_subnet.master_public_subnet will be destroyed
  # (because aws_subnet.master_public_subnet is not in configuration)
  - resource "aws_subnet" "master_public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:295093822487:subnet/subnet-0195870197a40c6ab" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "172.31.96.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0195870197a40c6ab" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "295093822487" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "Azamon_master_subnet"
        } -> null
      - tags_all                                       = {
          - "Name" = "Azamon_master_subnet"
        } -> null
      - vpc_id                                         = "vpc-08c07fc88ec42d090" -> null
    }

Plan: 9 to add, 0 to change, 1 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->